docs/posts/2024-12-17-blogging-with-org-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blogging with Org Mode</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Blogging with Org Mode
<br />
<span class="subtitle">Dec 17, 2024</span>
</h1>
<p>
This blog has been through many different versions. At various times, I&rsquo;ve used WordPress, Ghost, Jekyll, and Hugo, some more than once. I&rsquo;ve written posts in Markdown, HTML, Org mode, sometimes using more than one format in the same post. As Emacs users are prone to do, though, I&rsquo;m constantly trying to do more in Org mode. I could write posts in Org mode for Hugo, but I&rsquo;ve been tempted by the prospects of using Org to generate the entire site. I finally did it, and I&rsquo;m pleased with the results so far.
</p>

<p>
I started with the template provided by Sachin Patel that he describes <a href="https://opensource.com/article/20/3/blog-emacs">here</a>. I have changed some things, so I&rsquo;ll describe the site as I&rsquo;ve put it together. I highly recommend reading his post and cloning a copy of the template, though. Everything is in a directory named &ldquo;orgblog&rdquo; that has the following structure:
</p>

<div class="org-src-container">
<pre class="src src-shell">.
&#9500;&#9472;&#9472; css
&#9474;&#160;&#160; &#9492;&#9472;&#9472; stylesheet.css
&#9500;&#9472;&#9472; docs
&#9500;&#9472;&#9472; drafts
&#9500;&#9472;&#9472; html-templates
&#9474;&#160;&#160; &#9500;&#9472;&#9472; postamble.html
&#9474;&#160;&#160; &#9492;&#9472;&#9472; preamble.html
&#9500;&#9472;&#9472; images
&#9474;&#160;&#160; &#9500;&#9472;&#9472; favicon.ico
&#9474;&#160;&#160; &#9492;&#9472;&#9472; posts
&#9500;&#9472;&#9472; org-templates
&#9474;&#160;&#160; &#9500;&#9472;&#9472; latex-pdf.org
&#9474;&#160;&#160; &#9492;&#9472;&#9472; post.org
&#9500;&#9472;&#9472; pages
&#9474;&#160;&#160; &#9500;&#9472;&#9472; about.org
&#9474;&#160;&#160; &#9492;&#9472;&#9472; index.org
&#9500;&#9472;&#9472; posts
&#9474;&#160;&#160; &#9500;&#9472;&#9472; 24-12-05-sample-post.org
&#9474;&#160;&#160; &#9492;&#9472;&#9472; index.org
&#9492;&#9472;&#9472; publish.el
</pre>
</div>

<p>
I&rsquo;ve included a sample post and an about page as examples. I left the two files in the &ldquo;org-templates&rdquo; directory unchanged from the template, other than changing the author&rsquo;s name. I changed the HTML templates, removing the image and changing the menu from <code>preamble.html</code>, with no significant changes to <code>postamble.html</code>. Here is <code>preamble.html</code>:
</p>


<div class="org-src-container">
<pre class="src src-html">&lt;<span class="org-function-name">div</span> <span class="org-variable-name">class</span>=<span class="org-string">"banner"</span>&gt;
  &lt;<span class="org-function-name">h2</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"/"</span>&gt;Randy Ridenour&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">h2</span>&gt;
  &lt;<span class="org-function-name">nav</span> <span class="org-variable-name">class</span>=<span class="org-string">"navbar"</span>&gt;
    &lt;<span class="org-function-name">ul</span>&gt;
      &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"/posts/"</span>&gt;Blog&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
      &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"/about.html"</span>&gt;About&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
      &lt;<span class="org-function-name">li</span>&gt;&lt;<span class="org-function-name">a</span> <span class="org-variable-name">href</span>=<span class="org-string">"/index.xml"</span>&gt;RSS&lt;/<span class="org-function-name">a</span>&gt;&lt;/<span class="org-function-name">li</span>&gt;
    &lt;/<span class="org-function-name">ul</span>&gt;
  &lt;/<span class="org-function-name">nav</span>&gt;
&lt;/<span class="org-function-name">div</span>&gt;
</pre>
</div>


<p>
All the work gets done by the <code>publish.el</code> file. Here are some changes that I made to the template. First, since I&rsquo;m the sole author, I don&rsquo;t need &ldquo;Published by&#x2026;&rdquo; by every post title on the index page. 
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">me/website-html-preamble</span> (plist)
  <span class="org-doc">"PLIST: An entry."</span>
  (<span class="org-keyword">if</span> (org-export-get-date plist this-date-format)
      (plist-put plist
                 <span class="org-builtin">:subtitle</span> (format <span class="org-string">"%s"</span>
                                   (org-export-get-date plist this-date-format)
                                   (car (plist-get plist <span class="org-builtin">:author</span>)))))
</pre>
</div>


<p>
I made some slight changes to the <code>org-publish-project-alist</code>. First, I added a posts directory to help keep things organized. I also added a pages directory, instead of using a directory for each individual page. I also changed every reference to the &ldquo;public&rdquo; folder to &ldquo;docs&rdquo;, since Github pages will serve a site from a directory title &ldquo;docs&rdquo;. Here are the entries for posts and pages &#x2014; all of the others are basically the same as the template except for changing &ldquo;public&rdquo; to &ldquo;docs&rdquo;.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-publish-project-alist
      `((<span class="org-string">"posts"</span>
         <span class="org-builtin">:base-directory</span> <span class="org-string">"posts"</span>
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:recursive</span> t
         <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
         <span class="org-builtin">:publishing-directory</span> <span class="org-string">"./docs/posts/"</span>
         <span class="org-builtin">:exclude</span> ,(regexp-opt '(<span class="org-string">"README.org"</span> <span class="org-string">"draft"</span>))
         <span class="org-builtin">:auto-sitemap</span> t
         <span class="org-builtin">:sitemap-filename</span> <span class="org-string">"index.org"</span>
         <span class="org-builtin">:sitemap-title</span> <span class="org-string">"Blog Index"</span>
         <span class="org-comment-delimiter">;; </span><span class="org-comment">:sitemap-format-entry me/org-sitemap-format-entry</span>
         <span class="org-comment-delimiter">;; </span><span class="org-comment">:sitemap-style list</span>
         <span class="org-builtin">:sitemap-sort-files</span> anti-chronologically
         <span class="org-builtin">:html-link-home</span> <span class="org-string">"/"</span>
         <span class="org-builtin">:html-link-up</span> <span class="org-string">"/"</span>
         <span class="org-builtin">:html-head-include-scripts</span> t
         <span class="org-builtin">:html-head-include-default-style</span> nil
         <span class="org-builtin">:html-head</span> ,me/website-html-head
         <span class="org-builtin">:html-preamble</span> me/website-html-preamble
         <span class="org-builtin">:html-postamble</span> me/website-html-postamble)
        (<span class="org-string">"pages"</span>
         <span class="org-builtin">:base-directory</span> <span class="org-string">"pages"</span>
         <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
         <span class="org-builtin">:exclude</span> ,(regexp-opt '(<span class="org-string">"README.org"</span> <span class="org-string">"draft"</span>))
         <span class="org-builtin">:index-filename</span> <span class="org-string">"index.org"</span>
         <span class="org-builtin">:recursive</span> t
         <span class="org-builtin">:publishing-function</span> org-html-publish-to-html
         <span class="org-builtin">:publishing-directory</span> <span class="org-string">"./docs/"</span>
         <span class="org-builtin">:html-link-home</span> <span class="org-string">"/"</span>
         <span class="org-builtin">:html-link-up</span> <span class="org-string">"/"</span>
         <span class="org-builtin">:html-head-include-scripts</span> t
         <span class="org-builtin">:html-head-include-default-style</span> nil
         <span class="org-builtin">:html-head</span> ,me/website-html-head
         <span class="org-builtin">:html-preamble</span> me/website-html-preamble
         <span class="org-builtin">:html-postamble</span> me/website-html-postamble)
</pre>
</div>


<p>
I have a folder for drafts that doesn&rsquo;t get an entry in the <code>=project-alist</code>. When I&rsquo;m ready to publish a draft, I have a function that copies it to the posts directory and deletes it from the drafts directory.  I don&rsquo;t use the <code>serve.el</code> or the <code>makefile</code> from the template. Instead, I use the <code>org-publish-all</code> function to build the site and <code>serve</code> from npm to serve a local copy. I dropped a copy of <a href="https://neat.joeldare.com">Neat CSS</a> into the CSS folder and modified the <code>me/website-html-head</code> variable in <code>publish.el</code> to reflect that.
</p>

<p>
Here are the functions I use to build, serve, and deploy. To build the site, I run
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">orgblog-build</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">progn</span>
    (find-file <span class="org-string">"~/sites/orgblog/publish.el"</span>)
    (eval-buffer)
    (org-publish-all)
    (kill-buffer)))
</pre>
</div>

<p>
This function starts the server, waits for a second, then opens the default browser to localhost:
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">orgblog-serve</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">progn</span>
    (<span class="org-keyword">let</span> ((default-directory <span class="org-string">"~/sites/orgblog/docs"</span>))
        (async-shell-command <span class="org-string">"serve"</span>)
        (sleep-for 1)
        (async-shell-command <span class="org-string">"open http://localhost:3000"</span>))))
</pre>
</div>



<p>
If everything, looks good, then I can push changes to Github. The fish function <code>orgblog-push</code> changes to the site directory, adds all modifications, creates a commit with a default message, pushes the remote, then displays the current status of the repo.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">orgblog-push</span> ()
  (<span class="org-keyword">interactive</span>)
  (async-shell-command <span class="org-string">"orgblog-push"</span>))
</pre>
</div>


<p>
This moves a draft to the posts directory by saving the buffer, copying it to posts, moving the original to the trash in case something goes wrong, and killing the buffer. It then opens the posts directory in Dired.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">publish-orgblog-draft</span> ()
  (<span class="org-keyword">interactive</span>)
  (save-buffer)
  (copy-file (buffer-file-name) <span class="org-string">"~/sites/orgblog/posts/"</span>)
  (delete-file (buffer-file-name) t)
  (kill-buffer)
  (dired <span class="org-string">"~/sites/orgblog/posts"</span>))
</pre>
</div>

<p>
Finally, posts have these header lines:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-document-info-keyword">#+TITLE:</span> <span class="org-org-document-title">Sample Post</span>
<span class="org-org-document-info-keyword">#+date:</span> <span class="org-org-document-info">&lt;2024-12-05 Thu&gt;</span>
<span class="org-org-meta-line">#+filetags: blog emacs org</span>
<span class="org-org-meta-line">#+setupfile: ../org-templates/post.org</span>
</pre>
</div>

<p>
I&rsquo;m very happy with how things have turned out, and this should be enough to help others do the same. I&rsquo;ve been converting old posts to the new format and still have some 250 to go. That&rsquo;s giving me plenty of opportunities to develop my regex skills. The source for the site can be found on Github <a href="https://github.com/rlridenour/rlridenour.github.io">here</a>.
</p>


<div class="tagline" id="orga403b77">
<p>
Tagged: <a href="../tags/emacs.html">Emacs</a> <a href="../tags/org.html">Org</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
